layer {
  name: "train-data"
  type: "Data"
  top: "scaled"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.0125
    mean_file: "/home/greg/ws/digits/digits/jobs/20160617-172855-e351/mean.binaryproto"
  }
  data_param {
    source: "/home/greg/ws/digits/digits/jobs/20160617-172855-e351/train_db"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "colw1"
  type: "Colwolution"
  bottom: "scaled"
  top: "colw1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  colwolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "colw1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "colw2"
  type: "Colwolution"
  bottom: "pool1"
  top: "colw2"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  colwolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "colw2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool2"
  top: "ip1"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1.0
  }
  param {
    lr_mult: 2.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
